feniex/firm_F1-TestFixture/F1-TestFixture.cydsn/Generated_Source/PSoC5/ModeStatus.h
/*******************************************************************************
* File Name: ModeStatus.h  
* Version 1.90
*
* Description:
*  This file containts Status Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_STATUS_REG_ModeStatus_H) /* CY_STATUS_REG_ModeStatus_H */
#define CY_STATUS_REG_ModeStatus_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
    #include "CyLib.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 statusState;

} ModeStatus_BACKUP_STRUCT;


/***************************************
*        Function Prototypes
***************************************/

uint8 ModeStatus_Read(void) ;
void ModeStatus_InterruptEnable(void) ;
void ModeStatus_InterruptDisable(void) ;
void ModeStatus_WriteMask(uint8 mask) ;
uint8 ModeStatus_ReadMask(void) ;


/***************************************
*           API Constants
***************************************/

#define ModeStatus_STATUS_INTR_ENBL    0x10u


/***************************************
*         Parameter Constants
***************************************/

/* Status Register Inputs */
#define ModeStatus_INPUTS              6


/***************************************
*             Registers
***************************************/

/* Status Register */
#define ModeStatus_Status             (* (reg8 *) ModeStatus_sts_intr_sts_reg__STATUS_REG )
#define ModeStatus_Status_PTR         (  (reg8 *) ModeStatus_sts_intr_sts_reg__STATUS_REG )
#define ModeStatus_Status_Mask        (* (reg8 *) ModeStatus_sts_intr_sts_reg__MASK_REG )
#define ModeStatus_Status_Aux_Ctrl    (* (reg8 *) ModeStatus_sts_intr_sts_reg__STATUS_AUX_CTL_REG )

#endif /* End CY_STATUS_REG_ModeStatus_H */


/* [] END OF FILE */
